app/views/projects/_form.html.haml

        %p Category
        -#= select_tag "categories", options_for_select(@categories.collect{ |u| [ u.categories, u.id]})
---
SELECT "categories".* FROM "categories"