app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."parent_id" IS NULL
---
  def index
    @category = nil
    @categories = Category.find(:all, :conditions => {:parent_id => nil })