app/controllers/projects_controller.rb

  def index
    #@project = Project.all
    @projects = Project.where(user_id: current_user.id)
---
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = 1

  def new
    @project = Project.new
    @categories = Category.all
---
SELECT "categories".* FROM "categories"

  def create
    @categories = Category.all
    @user = current_user
    @project = Project.new(project_params)
    #
    if @project.save
---
SELECT "categories".* FROM "categories"
INSERT INTO "projects" ("category", "city", "created_at", "duration", "goal", "project_content", "project_name", "tags", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def edit
    @project = Project.find(params[:id])
    @categories = Category.all
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", "4"]]
SELECT "categories".* FROM "categories"

  def update
    @project = Project.find(params[:id])
    if @project.update_attributes(project_params)
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", "10"]]
UPDATE "projects" SET "duration" = $1, "goal" = $2, "category" = $3, "updated_at" = $4 WHERE "projects"."id" = 8  [["duration", 40], ["goal", 100.0], ["category", "4"], ["updated_at", Tue, 23 Jul 2013 19:38:51 UTC +00:00]]

  def destroy
    @project =Project.destroy(params[:id])
---
DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 2]]